# 当前项目仓库的路径
projectPath="./"

# Chinese , English
Language="Chinese"

# 对应feature:DebugMessage 调试信息
# 此处可选择对应需要开启调试信息的模块
# 可保持原样
debugMessage={
    "Core.DataCtrl.__init__":True
}

# 常量数据 大部分情况下不需要更改
constData={
    "screenshotMethod":"fast", # 截屏模块方法
    "version":"1.0.0.2.5", # 版本号
    "interval":"250",
    "systemName":"SeniorOS",
    "log":"SeniorOS > ",

}

Chineses={
    "SeniorOS 启动选择器":"SeniorOS 启动选择器",
    "请选择配置":"请选择配置",
    "云端通知":"云端通知",
    "请稍等":"请稍等",
    "加载成功":"加载成功",
    "加载失败":"加载失败",
    "控制面板":"控制面板",
    "正在进行操作":"正在进行操作",
    "动效开关":"动效开关",
    "日光模式":"日光模式",
    "亮度调节":"亮度调节",
    "当前值":"当前值",
    "开启":"开启",
    "关闭":"关闭",
    "设置":"设置",
    "网络与时间":"网络与时间",
    "界面与动效":"界面与动效",
    "缓存与运存":"缓存与运存",
    "系统与设备":"系统与设备",
    "联网相关设置及信息":"联网相关设置及信息",
    "界面动效参数及设置":"界面动效参数及设置",
    "应用缓存与设备内存":"应用缓存与设备内存",
    "系统设备信息及更新":"系统设备信息及更新",
    "测试":"测试",
}

English={
    "SeniorOS 启动选择器":"SeniorOS Bootloader",
    "请选择配置":"Select",
    "云端通知":"Cloud Notification",
    "请稍等":"Please wait",
    "加载成功":"Run successfully",
    "加载失败":"Run failure",
    "控制面板":"Control panel",
    "正在进行操作":"Running",
    "动效开关":"VastSea Switch",
    "日光模式":"Light Mode",
    "亮度调节":"Brightness Set",
    "当前值":"Current value",
    "开启":"ON",
    "关闭":"OFF",
    "设置":"Settings",
    "网络与时间":"Network and Time",
    "界面与动效":"UI and VastSea",
    "缓存与运存":"Memory",
    "系统与设备":"Equipment",
    "联网相关设置及信息":" ",
    "界面动效参数及设置":" ",
    "应用缓存与设备内存":" ",
    "系统设备信息及更新":" ",
    "测试":"test",
}

Korean={
    "SeniorOS 启动选择器":"선택기를 시작합니다",
    "请选择配置":"구성을 선택합니다",
    "云端通知":"클라우드 알림",
    "请稍等":"기다리세요",
    "加载成功":"성공하다",
    "加载失败":"실패하다",
    "控制面板":"제어판",
    "正在进行操作":"보내고", 
    "动效开关":"작동 스위치",
    "日光模式":"데이라이트 모드",
    "亮度调节":"밝기 조정",
    "当前值":"현재 가치",
    "开启":"열다",
    "关闭":"끄세요",
    "设置":"설립하다",
    "网络与时间":"네트워크 및 시간",
    "界面与动效":"인터페이스 및 애니메이션",
    "缓存与运存":"캐싱 및 스토리지",
    "系统与设备":"시스템 및 장비",
    "联网相关设置及信息":" ",
    "界面动效参数及设置":" ",
    "应用缓存与设备内存":" ",
    "系统设备信息及更新":" ",
    "测试":"테스트",
}